Setting up connection to MySQL

In [21]:
#!pip install ipython-sql


%load_ext sql


# user = root
# password = Magicman102
# database = cmsc461_personal_project
# host = localhost
connection_url = 'mysql+mysqlconnector://root:Magicman102@localhost/cmsc461_personal_project'

# Open a connection to the database
#%sql sqlite:///test.sqlite
%sql {connection_url}

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

PART A: Activities
1. Edit the details/characteristics of a given property.

Run the next piece of code to enter the id of a rental property you want to edit

In [22]:
#%%sql


# Edit the details/characteristics of a given property.

# Prompt the user to enter the ID number of the property they want to edit the details of
rental_property_id_str = input("Input the ID number of the rental property you want to edit the details of: ")
# Convert string to int
rental_property_id_int = int(rental_property_id_str)

Input the ID number of the rental property you want to edit the details of: 26

Run the next piece of code to enter what you want to change about the rental property

In [23]:
# Checks if rental property exists
result = %sql SELECT COUNT(*) AS count FROM rental_property WHERE rental_id = {rental_property_id_int}


# If 0, property does not exist
if(result[0][0]) == 0:
    print("\nProperty does not exist")
# If 1, property does exist
# Prompt user what details of the property they want to change
else:
    print("1. Change Street")
    print("2. Change City")
    print("3. Change State")
    print("4. Change Zipcode")
    print("5. Change Unit Number")
    print("6. Change Property Type")
    print("7. Change Number Bedrooms")
    print("8. Change Number Bathrooms")
    print("9. Change Area Square Footage")
    print("10. Change Monthly Rent")
    print("11. Change Monthly Management Fee")
    print("12. Change Whether or Not Property Has Been Advertised")
    print("13. Change Rental ID")
    print("14. Change Owner")
    number_str = input("Input the number of the details you want to edit: ")
    
    # Convert string to int
    number_int = int(number_str)
    
    if(number_int == 1):
        details_str = input("Input the Street: ")
        %sql UPDATE rental_property SET street = :details_str WHERE rental_id = :rental_property_id_int
    elif(number_int == 2):
        details_str = input("Input the City: ")
        %sql UPDATE rental_property SET city = :details_str WHERE rental_id = :rental_property_id_int
    elif(number_int == 3):
        details_str = input("Input the State: ")
        %sql UPDATE rental_property SET state = :details_str WHERE rental_id = :rental_property_id_int
    elif(number_int == 4):
        details_str = input("Input the Zipcode: ")
        details_int = int(details_str)
        %sql UPDATE rental_property SET zipcode = :details_int WHERE rental_id = :rental_property_id_int
    elif(number_int == 5):
        details_str = input("Input the Unit Number: ")
        details_int = int(details_str)
        %sql UPDATE rental_property SET unit_number = :details_int WHERE rental_id = :rental_property_id_int
    elif(number_int == 6):
        details_str = input("Input the Property Type: ")
        %sql UPDATE rental_property SET property_type = :details_str WHERE rental_id = :rental_property_id_int
    elif(number_int == 7):
        details_str = input("Input the Number of Bedrooms: ")
        details_int = int(details_str)
        %sql UPDATE rental_property SET number_bedrooms = :details_int WHERE rental_id = :rental_property_id_int
    elif(number_int == 8):
        details_str = input("Input the Number of Bathrooms: ")
        details_int = int(details_str)
        %sql UPDATE rental_property SET number_bathrooms = :details_int WHERE rental_id = :rental_property_id_int
    elif(number_int == 9):
        details_str = input("Change Area Square Footage: ")
        details_int = int(details_str)
        %sql UPDATE rental_property SET area_square_footage = :details_int WHERE rental_id = :rental_property_id_int
    elif(number_int == 10):
        details_str = input("Change Monthly Rent: ")
        details_int = int(details_str)
        %sql UPDATE rental_property SET monthly_rent = :details_int WHERE rental_id = :rental_property_id_int
    elif(number_int == 11):
        details_str = input("Change Monthly Management Fee: ")
        details_int = int(details_str)
        %sql UPDATE rental_property SET monthly_management_fee = :details_int WHERE rental_id = :rental_property_id_int
    elif(number_int == 12):
        details_str = input("Enter yes if property has been advertised. Enter no if property has not: ")
        
        if(details_str == "yes"):
            adv_value = 1
            %sql UPDATE rental_property SET adv = :adv_value WHERE rental_id = :rental_property_id_int
        elif(details_str == "no"):
            adv_value = 0
            %sql UPDATE rental_property SET adv = :adv_value WHERE rental_id = :rental_property_id_int
        else:
            print("You didn't enter yes or no")
    elif(number_int == 13):
        details_str = input("Enter new rental property id: ") 
        details_int = int(details_str)
                  
        # Checks if rental property exists
        result = %sql SELECT COUNT(*) AS count FROM rental_property WHERE rental_id = {details_int}
                  
        # If 0, property id does not exist
        if(result[0][0]) == 0:
            %sql SET FOREIGN_KEY_CHECKS = 0;
            
            # Change the id
            %sql UPDATE rental_property SET rental_id = :details_int WHERE rental_id = :rental_property_id_int
            
            # Change all of the foreign keys
            %sql UPDATE owned_by SET rental_id = :details_int WHERE rental_id = :rental_property_id_int
            %sql UPDATE viewing_for_property SET rental_id = :details_int WHERE rental_id = :rental_property_id_int
            %sql UPDATE managed_by SET rental_id = :details_int WHERE rental_id = :rental_property_id_int
            %sql UPDATE lease SET rental_id = :details_int WHERE rental_id = :rental_property_id_int
        
            %sql SET FOREIGN_KEY_CHECKS = 1;
        # If 1, property id already exists
        else:
            print("Cant use that id. It already exists")  
    elif(number_int == 14):
        details_str = input("Enter new rental property owner id: ") 
        details_int = int(details_str)
        
        # Checks if owner exists
        result = %sql SELECT COUNT(*) AS count FROM property_owner WHERE owner_id = {details_int}
        
        
        # If 0, property onwer does not exist
        if(result[0][0]) == 0:
            print("Owner does not exist")
        else:       
            # Change the owner id in the owned by table
            %sql UPDATE owned_by SET owner_id = :details_int WHERE rental_id = :rental_property_id_int  
           
    else:
        print("The number you entered is not an option")

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.
1. Change Street
2. Change City
3. Change State
4. Change Zipcode
5. Change Unit Number
6. Change Property Type
7. Change Number Bedrooms
8. Change Number Bathrooms
9. Change Area Square Footage
10. Change Monthly Rent
11. Change Monthly Management Fee
12. Change Whether or Not Property Has Been Advertised
13. Change Rental ID
14. Change Owner
Input the number of the details you want to edit: 1
Input the Street: bro street
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.

Run the next piece of code to see what you changed about the rental property

In [24]:
%sql SELECT * FROM rental_property WHERE rental_id = {rental_property_id_int}

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.

[(Decimal('26'), 'bro street', 'Red Cloud', 'Nebraska', Decimal('93843'), Decimal('245'), 'Residential', Decimal('1'), Decimal('1'), Decimal('100'), Decimal('100'), Decimal('10'), 1)]

If you changed the owner of the rental property, it will be reflected by running the next piece of code

In [25]:
%sql SELECT * FROM owned_by WHERE rental_id = {rental_property_id_int}

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.

[(Decimal('26'), Decimal('19'))]

2. Create a new client.
Run the next piece of code to create the new client

In [26]:
client_id_str = input("Input the ID number for the client: ")
client_id_int = int(client_id_str)

# Checks if the client id already exists
result = %sql SELECT COUNT(*) AS count FROM property_client WHERE client_id = {client_id_int}


if(result[0][0]) == 0:
    first_name_str = input("Input the first name of the client: ")
    last_name_str = input("Input the last name of the client: ")
    street_str = input("Input the street: ")
    city_str = input("Input the city: ")
    state_str = input("Input the state: ")
    zipcode_str = input("Input the zipcode: ")
    zipcode_int = int(zipcode_str)
    unit_number_str = input("Input the unit number: ")
    unit_number_int = int(unit_number_str)
    telephone_type_str = input("Input the telephone type: ")
    telephone_number_str = input("Input the telephone number: ")
    telephone_number_int = int(telephone_number_str)
    property_preferences_str = input("Input the property preferences: ")
    max_rent_str = input("Input the max rent: ")
    max_rent_int = int(max_rent_str)
    
    %sql INSERT INTO property_client (client_id, first_name, last_name, street, city, state, zipcode, unit_number, telephone_type, telephone_number, property_preferences, max_rent) VALUES ({client_id_int}, '{first_name_str}', '{last_name_str}', '{street_str}', '{city_str}', '{state_str}', {zipcode_int}, {unit_number_int}, '{telephone_type_str}', {telephone_number_int}, '{property_preferences_str}', {max_rent_int});
else:
    print("A client with that ID already exists")

Input the ID number for the client: 1000
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.
Input the first name of the client: Jason
Input the last name of the client: Jones
Input the street: 392 Wow Street
Input the city: Mount Airy
Input the state: Maryland
Input the zipcode: 12342
Input the unit number: 222
Input the telephone type: mobile
Input the telephone number: 3334445555
Input the property preferences: For parties
Input the max rent: 400
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.

Run the next piece of code to see the newly added client

In [27]:
%sql SELECT * FROM property_client WHERE client_id = {client_id_int}

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.

[(Decimal('1000'), 'Jason', 'Jones', '392 Wow Street', 'Mount Airy', 'Maryland', Decimal('12342'), Decimal('222'), 'mobile', Decimal('3334445555'), 'For parties', Decimal('400'))]

3. Enter information for a new property viewing
Run the next piece of code to do so

In [30]:
viewing_id_str = input("Input the ID number for the viewing: ")
viewing_id_int = int(viewing_id_str)

# Checks if the viewing id already exists
result = %sql SELECT COUNT(*) AS count FROM viewing_for_property WHERE viewing_id = {viewing_id_int}


# If the viewing id does not already exist
if(result[0][0]) == 0:
    rental_id_str = input("Input the ID number of the rental property: ")
    rental_id_int = int(rental_id_str)
    
    # Checks if the rental id already exists
    result = %sql SELECT COUNT(*) AS count FROM rental_property WHERE rental_id = {rental_id_int}
    
    # If the viewing id does exist
    if(result[0][0]) == 1:
        associate_id_str = input("Input the ID number of the associate: ")
        associate_id_int = int(associate_id_str) 
        
        # Checks if the associate exists
        result = %sql SELECT COUNT(*) AS count FROM associate WHERE associate_id = {associate_id_int}
        
        # If the associate id does exist
        if(result[0][0]) == 1:
            client_id_str = input("Input the ID number of the client: ")
            client_id_int = int(client_id_str) 
        
            # Checks if the client exists
            result = %sql SELECT COUNT(*) AS count FROM property_client WHERE client_id = {client_id_int}
            
            # If the client id does exist
            if(result[0][0]) == 1:
                date_str = input("Input the date of the viewing: ") 
                time_str = input("Input the time of the viewing")
                
                %sql INSERT INTO viewing_for_property (viewing_id, rental_id, associate_id, client_id, the_date, the_time) VALUES ({viewing_id_int}, {rental_id_int}, {associate_id_int}, {client_id_int}, '{date_str}', '{time_str}');
            else:
                print("That client id does not exist")
        else:
            print("That associate id does not exist")
    else:
        print("That rental id does not exist")
else:
    print("That viewing id already exists")

Input the ID number for the viewing: 100
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.
Input the ID number of the rental property: 31
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.
Input the ID number of the associate: 2
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.
Input the ID number of the client: 17
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.
Input the date of the viewing: 2024-3-26
Input the time of the viewing17:30
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.

Run the next piece of code to show the viewing you just created

In [31]:
%sql SELECT * FROM viewing_for_property WHERE viewing_id = {viewing_id_int}

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.

[(Decimal('100'), Decimal('31'), Decimal('2'), Decimal('17'), datetime.date(2024, 3, 26), '17:30')]

4. Discard a given property (and all its associated information).
Run the next piece of code to do so

In [32]:
property_id_str = input("Input the ID number for the property: ")
property_id_int = int(property_id_str)

# Checks if the viewing id already exists
result = %sql SELECT COUNT(*) AS count FROM rental_property WHERE rental_id = {property_id_int}


# If the viewing id exists
if(result[0][0]) == 1:
    %sql SET FOREIGN_KEY_CHECKS = 0;
        
    %sql DELETE FROM rental_property WHERE rental_id = {property_id_int};
    
    %sql DELETE FROM owned_by WHERE rental_id = {property_id_int};
    %sql DELETE FROM viewing_for_property WHERE rental_id = {property_id_int};
    %sql DELETE FROM managed_by WHERE rental_id = {property_id_int};
    %sql DELETE FROM lease WHERE rental_id = {property_id_int};
    
    %sql SET FOREIGN_KEY_CHECKS = 1;
else:
    print("That rental property ID does not exist")

Input the ID number for the property: 000032
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
0 rows affected.
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
0 rows affected.

Search for rentla property by id. Should no longer exist

In [33]:
%sql SELECT * FROM rental_property WHERE rental_id = {property_id_int}

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
0 rows affected.

[]

5. Change the partner assigned to an owner and transfer all current (non-expired) leases to the new partner.
Run the next piece of code to do so

In [40]:
%sql START TRANSACTION

owner_id_str = input("Input the ID number of the owner: ")
owner_id_int = int(owner_id_str)

# Checks if the owner id exists
result = %sql SELECT COUNT(*) AS count FROM property_owner WHERE owner_id = {owner_id_int}

# If 1, owner exists
if(result[0][0]) == 1:
    partner_id_str = input("Input the ID number of the partner: ")
    partner_id_int = int(partner_id_str) 
    
    # Checks if the partner id exists
    result = %sql SELECT COUNT(*) AS count FROM partner WHERE partner_id = {partner_id_int}
    
    # If 1, partner exists
    if(result[0][0]) == 1:
        # Gives all leases of owner to new partner 
        %sql UPDATE lease SET partner_id = {partner_id_int} WHERE owner_id = {owner_id_int}
        
        %sql COMMIT
    else:
        print("No partner exists with that ID")
else:
    print("No owner exists by that ID")

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
0 rows affected.
Input the ID number of the owner: 19
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.
Input the ID number of the partner: 5
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
5 rows affected.
 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
0 rows affected.

Run the next piece of code to show the new partner being assigned to all of the leases

In [42]:
%sql SELECT lease_id, owner_id, partner_id, rental_id FROM lease WHERE owner_id = {owner_id_int}

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
5 rows affected.

[(Decimal('56'), Decimal('19'), Decimal('5'), Decimal('26')),
 (Decimal('500'), Decimal('19'), Decimal('5'), Decimal('600')),
 (Decimal('501'), Decimal('19'), Decimal('5'), Decimal('601')),
 (Decimal('502'), Decimal('19'), Decimal('5'), Decimal('602')),
 (Decimal('503'), Decimal('19'), Decimal('5'), Decimal('603'))]

PART B: Queries and Reports
1. List the names of all (unique) clients.

In [43]:
%sql SELECT DISTINCT CONCAT(first_name, ' ', last_name) AS client_name FROM property_client;

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
12 rows affected.

[('Grant Walker',),
 ('Hunter Henry',),
 ('Irvin Alexander',),
 ('Jackson Jones',),
 ('Kelsey Mattison',),
 ('Logan Watkins',),
 ('Mason Rudolph',),
 ('Nelson Mandela',),
 ('Oliver Austin',),
 ('Penny Peters',),
 ('Quagmie Griffen',),
 ('Rose Handson',)]

2. Find the unique names of owners and total square footage of all the properties they own.

In [44]:
%%sql SELECT
CONCAT(property_owner.first_name, ' ', property_owner.last_name) AS owner_name,
    SUM(rental_property.area_square_footage) AS total_square_footage
FROM
    property_owner
JOIN
    owned_by ON property_owner.owner_id = owned_by.owner_id
JOIN
    rental_property ON owned_by.rental_id = rental_property.rental_id
GROUP BY
    property_owner.owner_id, owner_name;

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
9 rows affected.

[('Steven Taylor', Decimal('5100')),
 ('Thomas Miller', Decimal('1800')),
 ('Vince Powers', Decimal('2700')),
 ('Will Hill', Decimal('3000')),
 ('Yu Lu', Decimal('3900')),
 ('Zan Qui', Decimal('4200')),
 ('Rich Guy', Decimal('5000')),
 ('Pat Doe', Decimal('2400')),
 ('Cool Man', Decimal('600'))]

3. Find the properties shown by each associate in a given month.

In [45]:
%%sql
SELECT
    CONCAT(associate.first_name, ' ', associate.last_name) AS associate_name,
    CONCAT(rental_property.street, ', ', rental_property.city, ', ', rental_property.state) AS property_address
FROM
    viewing_for_property
JOIN
    associate ON viewing_for_property.associate_id = associate.associate_id
JOIN
    rental_property ON viewing_for_property.rental_id = rental_property.rental_id
# 3 is the 3rd month -> March
WHERE
    MONTH(viewing_for_property.the_date) = 3
ORDER BY
    associate.associate_id, viewing_for_property.rental_id;

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
18 rows affected.

[('Alex Smith', '837 Window Lane, Red Cloud, Nebraska'),
 ('Alex Smith', '987 Bicycle Road, Bath, North Carolina'),
 ('Alex Smith', '888 Wheelbarrow Lane, Richmond, Virginia'),
 ('Alex Smith', '418 Shovel Road, Gainsville, Florida'),
 ('Alex Smith', '728 Wonder Road, Chickasaw, Alabama'),
 ('Alex Smith', '729 Wonder Road, Chickasaw, Alabama'),
 ('Alex Smith', '730 Wonder Road, Chickasaw, Alabama'),
 ('Alex Smith', '731 Wonder Road, Chickasaw, Alabama'),
 ('Alex Smith', '732 Wonder Road, Chickasaw, Alabama'),
 ('Bill Johnson', '965 Dog Lane, Aberdeen, Washingon'),
 ('Bill Johnson', '948 Fish Road, Kelso, Washington'),
 ('Bill Johnson', '345 Paper Company Lane, Saint Cloud, Minnesota'),
 ('Bill Johnson', '659 Fan Road, Salem, New Hampshire'),
 ('Chris Moore', '398 Box Lane, Hillsboro, Oregon'),
 ('Chris Moore', '284 Present Road, Memphis, Tennessee'),
 ('Chris Moore', '738 Circle Lane, Knoxville, Tennessee'),
 ('Chris Moore', '098 Planet Road, Buffalo, Wyoming'),
 ('Chris Moore', '098 Planet Road, Buffalo, Wyoming')]

4. Find the most popular properties (in terms of number of viewings) in a given period (range of dates).

In [46]:
%%sql
SELECT
    CONCAT(rental_property.street, ', ', rental_property.city, ', ', rental_property.state) AS property_address,
    COUNT(*) AS num_viewings
FROM
    viewing_for_property
JOIN
    rental_property ON viewing_for_property.rental_id = rental_property.rental_id
WHERE
    viewing_for_property.the_date BETWEEN '2024-03-01' AND '2024-03-31'
GROUP BY
    viewing_for_property.rental_id,
    rental_property.street,
    rental_property.city,
    rental_property.state
ORDER BY
    num_viewings DESC;

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
17 rows affected.

[('098 Planet Road, Buffalo, Wyoming', 2),
 ('837 Window Lane, Red Cloud, Nebraska', 1),
 ('987 Bicycle Road, Bath, North Carolina', 1),
 ('888 Wheelbarrow Lane, Richmond, Virginia', 1),
 ('418 Shovel Road, Gainsville, Florida', 1),
 ('965 Dog Lane, Aberdeen, Washingon', 1),
 ('948 Fish Road, Kelso, Washington', 1),
 ('345 Paper Company Lane, Saint Cloud, Minnesota', 1),
 ('659 Fan Road, Salem, New Hampshire', 1),
 ('398 Box Lane, Hillsboro, Oregon', 1),
 ('284 Present Road, Memphis, Tennessee', 1),
 ('738 Circle Lane, Knoxville, Tennessee', 1),
 ('728 Wonder Road, Chickasaw, Alabama', 1),
 ('729 Wonder Road, Chickasaw, Alabama', 1),
 ('730 Wonder Road, Chickasaw, Alabama', 1),
 ('731 Wonder Road, Chickasaw, Alabama', 1),
 ('732 Wonder Road, Chickasaw, Alabama', 1)]

5. Find the total rent due to each property owner in a given month year.

In [48]:
%%sql
SELECT
    CONCAT(property_owner.first_name, ' ', property_owner.last_name) AS owner_name,
    SUM(lease.monthly_rent) AS total_rent_due
FROM
    lease
JOIN
    property_owner ON lease.owner_id = property_owner.owner_id
WHERE
    # Lease started before May 2024 and lease ends after May 2024
    DATE(lease.start_date) <= '2024-5-1' AND DATE(lease.end_date) >= '2024-5-31'
GROUP BY
    property_owner.owner_id,
    owner_name
ORDER BY
    total_rent_due DESC;

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
6 rows affected.

[('Zan Qui', Decimal('1400')),
 ('Yu Lu', Decimal('1300')),
 ('Will Hill', Decimal('800')),
 ('Vince Powers', Decimal('700')),
 ('Steven Taylor', Decimal('500')),
 ('Thomas Miller', Decimal('200'))]

6. Find the unique names of clients that were ever shown at least three or more unique residential properties owned by a given owner.

In [58]:
%%sql
SELECT DISTINCT property_client.first_name, property_client.last_name
FROM viewing_for_property
JOIN rental_property ON viewing_for_property.rental_id = rental_property.rental_id
AND rental_property.property_type = 'Residential' -- Added condition here
JOIN owned_by ON rental_property.rental_id = owned_by.rental_id
JOIN property_owner ON owned_by.owner_id = property_owner.owner_id
JOIN property_client ON viewing_for_property.client_id = property_client.client_id
-- "Given owner" is currently "Rich Guy"
WHERE property_owner.first_name = 'Rich'
AND property_owner.last_name = 'Guy'
GROUP BY property_client.first_name, property_client.last_name
HAVING COUNT(DISTINCT rental_property.rental_id) >= 3;

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.

[('Grant', 'Walker')]

7. Find the unique names of owners that have a residential property in every city where Pat Doe owns a commercial property.

In [50]:
%%sql

-- 1. Gets every time a city is in the list of cities owned by Pat Doe
-- 2. Gets count of distinct cities
-- 3. Compares count of distinct cities to count of distinct cities owned by Pat Doe
-- 4. If numbers match, person fufills the criteria


SELECT po.first_name, po.last_name
FROM property_owner po
JOIN owned_by o ON po.owner_id = o.owner_id
JOIN rental_property r ON o.rental_id = r.rental_id
WHERE r.property_type = 'Residential'
-- Gets Every time a city is in the list of cities owned by Pat Doe
AND r.city IN (
    SELECT DISTINCT r2.city
    FROM rental_property r2
    JOIN owned_by o2 ON r2.rental_id = o2.rental_id
    JOIN property_owner po2 ON o2.owner_id = po2.owner_id
    WHERE r2.property_type = 'Commercial'
    AND po2.first_name = 'Pat'
    AND po2.last_name = 'Doe'
)
GROUP BY po.first_name, po.last_name
-- Removes repeat cities, gets total
HAVING COUNT(DISTINCT r.city) = (
    SELECT COUNT(DISTINCT r2.city)
    FROM rental_property r2
    JOIN owned_by o2 ON r2.rental_id = o2.rental_id
    JOIN property_owner po2 ON o2.owner_id = po2.owner_id
    WHERE r2.property_type = 'Commercial'
    AND po2.first_name = 'Pat'
    AND po2.last_name = 'Doe'
);

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.

[('Cool', 'Man')]

8. Find the top-3 partners with respect to number of properties leased in the current year.

In [59]:
%%sql
SELECT partner.first_name, partner.last_name, COUNT(lease.rental_id) AS num_properties_leased
FROM partner
JOIN lease ON partner.partner_id = lease.partner_id
WHERE YEAR(lease.start_date) = 2024
GROUP BY partner.partner_id, partner.first_name, partner.last_name
ORDER BY num_properties_leased DESC
LIMIT 3;

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
3 rows affected.

[('Dalton', 'Schultz', 6), ('Emmanuel', 'Mudiay', 2), ('Fred', 'Flinstone', 2)]

9.  Write a SQL function to compute the total management fees due to Pluto in the last 3 months.
The next line of code creates the function

In [52]:
%%sql
CREATE FUNCTION CalculateTotalManagementFeesDueToPluto()
RETURNS DECIMAL(10,2)
READS SQL DATA
BEGIN
    DECLARE total_fees DECIMAL(10,2);
    SET total_fees = (
        SELECT SUM(monthly_management_fee) AS total_fees
        FROM rental_property
    );
    SET total_fees = total_fees * 3;
    RETURN total_fees;
END;

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
0 rows affected.

[]

Next line of code runs the function

In [53]:
%%sql
SELECT CalculateTotalManagementFeesDueToPluto() AS total_management_fees_due_to_pluto;

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.

[(Decimal('8580.00'),)]

10. Create a SQL trigger to automatically set to FALSE the ADV flag of a property when it is leased.
The next line of code creates the trigger

In [54]:
%%sql
CREATE TRIGGER SetADVFlagOnLease
AFTER INSERT ON lease
FOR EACH ROW
BEGIN
    UPDATE rental_property
    SET adv = FALSE
    WHERE rental_id = NEW.rental_id;
END;

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
0 rows affected.

[]

The next line of code shows the adv boolean before the trigger

In [55]:
%%sql
SELECT adv
FROM rental_property
WHERE rental_id = 777777;

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.

[(1,)]

The next line of code creates the new lease

In [56]:
%%sql 
INSERT INTO lease (lease_id, client_id, owner_id, partner_id, rental_id, the_date, monthly_rent, deposit, lease_duration, start_date, end_date)
VALUES (123456, 000009, 000051, 000005, 777777, "4/1/2024", 100, 100, "3 months", "2024-4-1", "2024-7-1");

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.

[]

The next line of code shows the adv boolean after the new lease was created

In [57]:
%%sql
SELECT adv
FROM rental_property
WHERE rental_id = 777777;

 * mysql+mysqlconnector://root:***@localhost/cmsc461_personal_project
1 rows affected.

[(0,)]